In [2]:
import pandas as pd
import numpy as np

dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,np.nan,99,87,np.nan,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female'],
                'Email':['priyang@gmail.com','aadhya@gmail.com',
                        'krisha@gmail.com','vedant@yahoo.com','parshv@hotmail.com',
                         'mittal@yahoo.com','archana@yahoo.com']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [3]:
# All rows except last 2 rows
df1.head(-2)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com

In [4]:
# All rows except first 3 rows
df1.tail(-3)

      Name  Marks  Gender               Email
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [6]:
# Find the shape of our dataset
print(f"Rows: {df1.shape[0]}, Columns: {df1.shape[1]}")

Rows: 7, Columns: 4

In [7]:
# check null values and drop them
df1.isnull().sum()
# df1.dropna()

Name      0
Marks     2
Gender    0
Email     0
dtype: int64

In [8]:
# Find unique value from the gender column
df1['Marks'].unique()

array([98., nan, 99., 87., 83.])

In [9]:
# Find number of unique value from the gender column
df1['Marks'].nunique()

4

In [10]:
# Display count of unique value from the gender column
df1['Marks'].value_counts()

Marks
99.0    2
98.0    1
87.0    1
83.0    1
Name: count, dtype: int64

In [ ]:
# Handling missing values
df1['Marks'].fillna(df1['Marks'].mean(),inplace=True)

In [15]:
# Marks between 80 to 90
df1[df1['Marks'].between(80,90)][['Marks']]

   Marks
3   87.0
5   83.0

In [16]:
# Name of the students with lowest marks
df1[df1['Marks']==df1['Marks'].min()]['Name']

5    Mittal
Name: Name, dtype: object

In [17]:
# Top 5 students with highest marks
df1.nlargest(5,'Marks')

      Name  Marks  Gender               Email
2   Krisha   99.0  Female    krisha@gmail.com
6  Archana   99.0  Female   archana@yahoo.com
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya   93.2  Female    aadhya@gmail.com
4   Parshv   93.2    Male  parshv@hotmail.com

In [29]:
# Mapping male to 0 and female to 1
df1['Male_Female'] = df1['Gender'].map({'Male': 0, 'Female': 1})
df1[['Gender', 'Male_Female']]

   Gender  Male_Female
0    Male            0
1  Female            1
2  Female            1
3    Male            0
4    Male            0
5  Female            1
6  Female            1

In [30]:
# sort the dataframe by marks
df1.sort_values('Marks')

      Name  Marks  Gender               Email  Male_Female
5   Mittal   83.0  Female    mittal@yahoo.com            1
3   Vedant   87.0    Male    vedant@yahoo.com            0
0  Priyang   98.0    Male   priyang@gmail.com            0
2   Krisha   99.0  Female    krisha@gmail.com            1
6  Archana   99.0  Female   archana@yahoo.com            1
1   Aadhya    NaN  Female    aadhya@gmail.com            1
4   Parshv    NaN    Male  parshv@hotmail.com            0

In [32]:
# Display Name and Marks of the female students
df1[df1['Gender'] == 'Female'][['Name', 'Marks']]

      Name  Marks
1   Aadhya    NaN
2   Krisha   99.0
5   Mittal   83.0
6  Archana   99.0

In [33]:
# Rename the marks column to score
df1.rename(columns={'Marks': 'Score'}, inplace=True)

      Name  Score  Gender               Email  Male_Female
0  Priyang   98.0    Male   priyang@gmail.com            0
1   Aadhya    NaN  Female    aadhya@gmail.com            1
2   Krisha   99.0  Female    krisha@gmail.com            1
3   Vedant   87.0    Male    vedant@yahoo.com            0
4   Parshv    NaN    Male  parshv@hotmail.com            0
5   Mittal   83.0  Female    mittal@yahoo.com            1
6  Archana   99.0  Female   archana@yahoo.com            1